razabg/STM32_Nucleo_l476rg_Embedded/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"
#include "fatfs.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <stdarg.h> //for va_list var arg functions
#include "basics.h"
#include "../shared/Buzzer.h"
#include "../shared/rtc_ds1307_I2C.h"
#include "../shared/datetime.h"
#include "../shared/dht2.h"
#include "../shared/sdfatfs.h"

//#include "../shared/uart_queue.h"
//#include "../shared/TimerTasks.h"
//#include "../shared/msgQueueEx.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
//extern Queue * queue;

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
ADC_HandleTypeDef hadc2;

I2C_HandleTypeDef hi2c3;

RTC_HandleTypeDef hrtc;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim6;
TIM_HandleTypeDef htim7;
TIM_HandleTypeDef htim16;

UART_HandleTypeDef huart2;

DMA_HandleTypeDef hdma_memtomem_dma1_channel1;
/* Definitions for defaultTask */
osThreadId_t defaultTaskHandle;
const osThreadAttr_t defaultTask_attributes = {
  .name = "defaultTask",
  .stack_size = 128 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for DHTask */
osThreadId_t DHTaskHandle;
const osThreadAttr_t DHTask_attributes = {
  .name = "DHTask",
  .stack_size = 512 * 4,
  .priority = (osPriority_t) osPriorityHigh,
};
/* Definitions for saveTask */
osThreadId_t saveTaskHandle;
const osThreadAttr_t saveTask_attributes = {
  .name = "saveTask",
  .stack_size = 512 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for myQueue01 */
osMessageQueueId_t myQueue01Handle;
const osMessageQueueAttr_t myQueue01_attributes = {
  .name = "myQueue01"
};
/* USER CODE BEGIN PV */

Buzzer_Handle *buzzer = NULL;
DateTime* g_dt = NULL;

//#define DHT_TASK    0x01   // bit 0
//#define PRINT_TASK  0x02   // bit 1
//#define FLAG_TASK3  0x04   // bit 2
//
//#define FLAG_DONE1  0x08
//#define FLAG_DONE2  0x10
//#define FLAG_DONE3  0x20
//
//#define SET_RTC_TIME    0   // set to 1 only when you want to (re)write the clock
//
///* Notification IDs sent from ISRs to DhtTask, distinguishing the two sources */
//#define NOTIF_FROM_BUTTON  0x01u
//#define NOTIF_FROM_TIMER   0x02u

/* Queue message: what DhtTask sends to PrintTask */
typedef enum { MSG_TEMPERATURE, MSG_HUMIDITY } DHT_MsgType_t;
//
typedef struct {
    DHT_MsgType_t type;
    uint8_t       int_part;
    uint8_t       dec_part;
} DHT_QueueMsg_t;


static DHT_Handle *dht = NULL;
DHT_Data dht_data = {0};


uint8_t rx_byte;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_TIM6_Init(void);
static void MX_TIM16_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM7_Init(void);
static void MX_TIM3_Init(void);
static void MX_ADC1_Init(void);
static void MX_ADC2_Init(void);
static void MX_I2C3_Init(void);
static void MX_RTC_Init(void);
static void MX_SPI1_Init(void);
void StartDefaultTask(void *argument);
void StartDHT(void *argument);
void StartSave(void *argument);

/* USER CODE BEGIN PFP */
void SD_FatFs_Test(void);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
// call ONCE to set the clock, then comment out and reflash

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* Configure the peripherals common clocks */
  PeriphCommonClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART2_UART_Init();
  MX_TIM6_Init();
  MX_TIM16_Init();
  MX_TIM2_Init();
  MX_TIM7_Init();
  MX_TIM3_Init();
  MX_ADC1_Init();
  MX_ADC2_Init();
  MX_I2C3_Init();
  MX_RTC_Init();
  MX_SPI1_Init();
  MX_FATFS_Init();
  /* USER CODE BEGIN 2 */
  /* TIM2: free-running 1us counter used by the DHT11 driver for bit timing.
     Non-interrupt start — we only ever poll its CNT register. */
  HAL_TIM_Base_Start(&htim2);

#if SET_RTC_TIME
  RTC_Time_t setTime = {.sec=0, .min=21, .hour=17, .dow=4, .date=8, .month=7, .year=26};
  RTC_SetTime(&hi2c3, &setTime);
#endif

//  SD_FatFs_Test();

     // Set an initial time/date once (only needed the first time,
//     // or whenever the backup domain loses power / gets reset)
//     DateTime_SetTime(g_dt, 14,14, 0);        // 14:30:00
//     DateTime_SetDate(g_dt, 26, 7, 12, 1);      // 2026/07/09, weekday 4 (Thursday)
//     DateTime_WriteToRTC(g_dt);



  /* USER CODE END 2 */

