razabg/STM32_Nucleo_l476rg_Embedded/Core/Src/main.c
  /*Configure GPIO pin : RGB_LED_Pin */
  GPIO_InitStruct.Pin = RGB_LED_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(RGB_LED_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : DHT_Pin */
  GPIO_InitStruct.Pin = DHT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(DHT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : SD_CS_Pin */
  GPIO_InitStruct.Pin = SD_CS_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(SD_CS_GPIO_Port, &GPIO_InitStruct);

  /* USER CODE BEGIN MX_GPIO_Init_2 */

  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
/* USER CODE BEGIN 4 */

void SD_FatFs_Test(void)
{
  static FATFS FatFs;
  FIL fil;
  UINT bytesWrote;
  char line[64];
  const char *msg = "hello world raz\r\n";

  HAL_Delay(1000);

  FRESULT fres = f_mount(&FatFs, "", 1);
  if (fres != FR_OK) {
    printf("SD mount failed (%i)\r\n", fres);
    return;
  }

  if (f_open(&fil, "hello.txt", FA_WRITE | FA_CREATE_ALWAYS) != FR_OK) {
    printf("SD open failed\r\n");
    f_mount(NULL, "", 0);
    return;
  }

  fres = f_write(&fil, msg, strlen(msg), &bytesWrote);
  f_close(&fil);
  if (fres != FR_OK) {
    printf("SD write failed (%i)\r\n", fres);
    f_mount(NULL, "", 0);
    return;
  }
  printf("Wrote %u bytes\r\n", bytesWrote);

  if (f_open(&fil, "hello.txt", FA_READ) != FR_OK) {
    printf("SD read-open failed\r\n");
    f_mount(NULL, "", 0);
    return;
  }

  while (f_gets(line, sizeof(line), &fil)) {
    printf("%s", line);
  }

  f_close(&fil);
  f_mount(NULL, "", 0);

  printf("SD test complete\r\n");
}


#include <string.h>
#include "stm32l4xx_hal.h"

#define FLASH_USER_ADDR   0x080FF800U   // last 2KB page of 1MB flash on STM32L476RG

void Flash_WriteString(uint32_t address, char *str)
{
    // Step 1: Unlock flash — it's write-protected by default.
    // HAL_FLASH_Unlock() handles the internal key-sequence for you.
    HAL_FLASH_Unlock();

    // Step 2: Erase the page first.
    // Flash can only flip bits 1->0 when programming. To get back to a
    // clean slate (all 1s) you must erase the whole page beforehand.
    FLASH_EraseInitTypeDef EraseInitStruct;
    uint32_t PageError = 0;

    EraseInitStruct.TypeErase = FLASH_TYPEERASE_PAGES;
    EraseInitStruct.Banks     = FLASH_BANK_2;   // last page falls in bank 2 on a 1MB part
    EraseInitStruct.Page      = 255;            // page index within that bank
    EraseInitStruct.NbPages   = 1;

    if (HAL_FLASHEx_Erase(&EraseInitStruct, &PageError) != HAL_OK)
    {
        HAL_FLASH_Lock();
        Error_Handler();   // PageError tells you which page failed, if nonzero
    }

    // Step 3: Program the string, 8 bytes (one "double word") at a time.
    // The L4 flash peripheral only accepts writes in 8-byte chunks.
    int len = strlen(str) + 1;   // +1 to include the null terminator '\0'
    uint32_t addr = address;

    // Outer loop: picks which group of 8 bytes we're on, and which
    // flash address that group goes to.
    for (int i = 0; i < len; i += 8)
    {
        // A union: u.bytes and u.dword are the SAME 8 bytes of memory,
        // just viewed two different ways. Writing to u.bytes[j] also
        // changes u.dword — no copying needed.
        union {
            uint64_t dword;
            uint8_t  bytes[8];
        } u;

        // Reset to "erased" value (all 1 bits) before filling this group.
        // Anything we don't overwrite below stays as 0xFF.
        u.dword = 0xFFFFFFFFFFFFFFFF;

        // Inner loop: fills this one group's 8 slots (or fewer, if the
        // string runs out first).
        for (int j = 0; j < 8 && (i + j) < len; j++)
        {
            u.bytes[j] = str[i + j];
        }

        // Ship this group of 8 bytes to flash as one 64-bit write.
        HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, addr, u.dword);

        // Move to the next 8-byte address for the next group.
        addr += 8;
    }

    // Step 4: Re-lock flash so nothing else can accidentally write to it.
    HAL_FLASH_Lock();
}
/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void *argument)
{
  /* USER CODE BEGIN 5 */
  /* Infinite loop */
  for(;;)
  {
    osDelay(1);
  }
  /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_StartDHT */
/**
* @brief Function implementing the DHTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartDHT */
void StartDHT(void *argument)
{
  /* USER CODE BEGIN StartDHT */
	dht = DHT_Create(DHT_GPIO_Port,DHT_Pin,&htim2);
			if (!dht) {
				printf("dht == null");
			}
			DHT_Result result;
  /* Infinite loop */
  for(;;)
  {
	  		 DHT_Result result = DHT_Read(dht, &dht_data);
	  		if (result == DHT_NO_RESPONSE){
	  		        printf("DHT: No response\r\n");}
	  		    else if (result == DHT_CHECKSUM_ERROR){
	  		        printf("DHT: Checksum error\r\n");}
	  		    else
	  		        {printf("DHT: Read OK\r\n");}
	  		osMessageQueuePut(myQueue01Handle, &dht_data, 0, osWaitForever);

    osDelay(3000);
  }
  /* USER CODE END StartDHT */
}

/* USER CODE BEGIN Header_StartSave */
/**
* @brief Function implementing the saveTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartSave */
void StartSave(void *argument)
{
  /* USER CODE BEGIN StartSave */
  DHT_Data received;
  char line[64];

  /* Infinite loop */
  for(;;)
  {
    if (osMessageQueueGet(myQueue01Handle, &received, NULL, osWaitForever) == osOK)
    {
      snprintf(line, sizeof(line), "T:%u.%u H:%u.%u\r\n",
               received.temperature_int, received.temperature_dec,
               received.humidity_int, received.humidity_dec);

      SDFatFS_SaveString("dht_log.txt", line);
      SDFatFS_PrintFile("dht_log.txt");
    }
  }
  /* USER CODE END StartSave */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
